# duplicate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnnotationSymbol..::..duplicate Method
AnnotationSymbol Class See Also
---
Duplicate this annotation symbol.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AnnotationSymbol duplicate()
```

Visual Basic
---
```text
Public Function duplicate As AnnotationSymbol
```

Visual C++
---
```text
public:
AnnotationSymbol^ duplicate()
```

# ### Return Value
Pointer to the new annotation symbol.
# See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace